app/Http/Controllers/WebController.php

    public function contactSave(Request $request)
    {
        // Validate input fields
        $validator = Validator::make($request->all(), [
            'name' => ['required', 'string', 'max:128'],
            'mobile' => ['required', 'regex:/^(\+?[0-9]{10,15})$/'], // Validate international mobile numbers
            'email' => ['nullable', 'email'], // Optional email validation
            'message' => ['required', 'string'],
        ]);

        // If validation fails, redirect back with errors and old input
        if ($validator->fails()) {
            return redirect()->back()->withErrors($validator)->withInput();
        }

        try {
            // Save the contact message
            $contact = new Contact();
            $contact->name = $request->input('name');
            $contact->mobile = $request->input('mobile');
            $contact->email = $request->input('email', null); // Defaults to null if not provided
            $contact->message = $request->input('message');
            $contact->save();
---
insert into `contacts` (`name`, `mobile`, `email`, `message`, `updated_at`, `created_at`) values ('Neamat Ullah', '01756296633', 'admin@gmail.com', 'Hi How are you', '2024-12-13 00:11:18', '2024-12-13 00:11:18')