app/Http/Controllers/Admin/ContactController.php

    public function index(){
        $data['contacts'] = Contact::all();
---
select * from `contacts`

    public function destroy(Request $request){
        try {
            $contact = Contact::findOrFail(decrypt($request->id));
            $contact->delete();
---
select * from `contacts` where `contacts`.`id` = 1 limit 1
delete from `contacts` where `id` = 1